moria2/xdocs/howto_service_example_soap_proxyAuthentication.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
Copyright (c) 2004 UNINETT

This program is free software; you can redistribute it and/or modify it
under the terms of the GNU General Public License as published by the Free
Software Foundation; either version 2 of the License, or (at your option)
any later version.

This program is distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
more details.

You should have received a copy of the GNU General Public License along with
this program; if not, write to the Free Software Foundation, Inc., 59 Temple
Place - Suite 330, Boston, MA 02111-1307, USA.

$Id$
-->
<document>
	<properties>
		<title>Service Integration - proxyAuthentication SOAP Example</title>
		<author email="cato.olsen@uninett.no">Cato Olsen</author>
	</properties>
	<body>
		<section name="proxyAuthentication SOAP Example">
		
		<subsection name="Client SOAP Request">
			<p>
			Using a proxy ticket (here
			<code>MDA3AAABAVwaUL6fRITMT0eux25M*s2yHbgbhQ3pWf8V8qWpYsaBfMFx-h0dafwwM7OgzxU4blCDgcY</code>
			supplied by the parent Moria2-enabled service (through
			<code>getProxyTicket</code>, see separate
			<a href="howto_service_example_soap_getProxyTicket.html">SOAP example</a>),
			the subservice request an authentication confirmation for the user
			belonging to the authentication session pointed to by the proxy
			ticket. In addition, the subservice requests the attribute
			<i>eduPersonAffiliation</i>.
			</p>
			<source>
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://schemas.xmlsoap.org/soap/encoding/"&gt;
	&lt;SOAP-ENV:Body&gt;
		&lt;m:proxyAuthentication xmlns:m="http://v2_1.webservices.moria.feide.no" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"&gt;
			&lt;attributes xsi:type="SOAP-ENC:Array" SOAP-ENC:arrayType="m0:string[1]"&gt;
				&lt;m0:item0 xsi:type="xsd:string"&gt;eduPersonAffiliation&lt;/m0:item0&gt;
			&lt;/attributes&gt;
			&lt;proxyTicket xsi:type="xsd:string"&gt;MDA3AAABAVwaUL6fRITMT0eux25M*s2yHbgbhQ3pWf8V8qWpYsaBfMFx-h0dafwwM7OgzxU4blCDgcY&lt;/proxyTicket&gt;
		&lt;/m:proxyAuthentication&gt;
	&lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;</source>
		</subsection>
		
		<subsection name="Moria2 SOAP Reply">
			<p>
			Moria2 has checked the subservice's authorization data and found the
			above request to be valid. The requested multi-valued attribute
			<i>eduPersonAffiliation</i> is returned.
			</p>
			<source>
&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
	&lt;soapenv:Body&gt;
		&lt;ns1:proxyAuthenticationResponse soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://v2_1.webservices.moria.feide.no"&gt;
			&lt;ns1:proxyAuthenticationReturn xsi:type="soapenc:Array" soapenc:arrayType="ns2:Attribute[1]" xmlns:ns2="https://login.feide.no/moria/v2_1/Authentication" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"&gt;
				&lt;item href="#id0"/&gt;
			&lt;/ns1:proxyAuthenticationReturn&gt;
		&lt;/ns1:proxyAuthenticationResponse&gt;
		&lt;multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns3:Attribute" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns3="https://login.feide.no/moria/v2_1/Authentication"&gt;
			&lt;name xsi:type="xsd:string"&gt;eduPersonAffiliation&lt;/name&gt;
			&lt;values xsi:type="soapenc:Array" soapenc:arrayType="xsd:string[4]"&gt;
				&lt;item&gt;employee&lt;/item&gt;
				&lt;item&gt;staff&lt;/item&gt;
				&lt;item&gt;student&lt;/item&gt;
				&lt;item&gt;test user&lt;/item&gt;
			&lt;/values&gt;
		&lt;/multiRef&gt;
	&lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;</source>
		</subsection>
		
		</section>
	</body>
</document>
